ErpTest/src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/СчетаРеглУчетаТребующиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаРеглУчетаТребующиеНастройки</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.КатегорииЭксплуатации</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
      <types>CatalogRef.Кассы</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
      <types>CatalogRef.Резервы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ВидыСчетовЗаписываемыеВРегистрТребующихсяНастроек = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.НастраиваемыеВидыСчетов();
	МассивЗаписейДляУдаления = Новый Массив;
	КодОсновногоЯзыка = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
	ШаблонСообщения = НСтр("ru = 'При записи счетов требующих настроек, ошибка: для вида счета ""%1""'", КодОсновногоЯзыка);
	ОбъектМетаданных = Метаданные.РегистрыСведений.СчетаРеглУчетаТребующиеНастройки;
	ОтражаемыйДокумент = Неопределено;
	ДополнительныеСвойства.Свойство("Документ", ОтражаемыйДокумент);
	
	Для каждого СтрокаРегистра Из ЭтотОбъект Цикл
		
		Если ВидыСчетовЗаписываемыеВРегистрТребующихсяНастроек.Найти(СтрокаРегистра.ВидСчета) = Неопределено Тогда
			// Данный вид счета не настраивается в рабочем месте, поэтому его запись в данный регистр не имеет смысла.
			МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
			Продолжить;
		КонецЕсли;
		
		ОбязательныеИзмеренияРегистра = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.СписокИзмеренийРегистраПоВидуСчета(СтрокаРегистра.ВидСчета, Истина);
		ОбязательныеИзмеренияРегистра.Добавить("ВидСчета");
		
		Для каждого ИзмерениеРегистра Из ОбязательныеИзмеренияРегистра Цикл
			Если Не ЗначениеЗаполнено(СтрокаРегистра[ИзмерениеРегистра]) Тогда
				ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'не заполнено измерение регистра ""%2"".'", КодОсновногоЯзыка);
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ИзмерениеРегистра);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете'", КодОсновногоЯзыка), 
					УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
			КонецЕсли;
		КонецЦикла;
		
		ОграничениеТипаМестоУчета = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ОграничениеТипаМестаУчетаПоВидуСчета(СтрокаРегистра.ВидСчета);
		Если ОграничениеТипаМестоУчета <> Неопределено И Не ОграничениеТипаМестоУчета.СодержитТип(ТипЗнч(СтрокаРегистра.МестоУчета)) Тогда
			ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'тип значения измерения ""Место учета"" (%2) не соответствует требуемому.'", КодОсновногоЯзыка);
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ТипЗнч(СтрокаРегистра.МестоУчета));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете'", КодОсновногоЯзыка), 
				УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
			МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
		КонецЕсли;
		
		ОграничениеТипаАналитикаУчета = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ОграничениеТипаАналитикаУчетаПоВидуСчета(СтрокаРегистра.ВидСчета);
		Если ОграничениеТипаАналитикаУчета <> Неопределено И Не ОграничениеТипаАналитикаУчета.СодержитТип(ТипЗнч(СтрокаРегистра.АналитикаУчета)) Тогда
			ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'тип значения измерения ""Аналитика учета"" (%2) не соответствует требуемому.'", КодОсновногоЯзыка);
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ТипЗнч(СтрокаРегистра.АналитикаУчета));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете'", КодОсновногоЯзыка), 
				УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
			МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЗаписейДляУдаления.Количество() Тогда
		Для каждого ЗаписьДляУдаления Из МассивЗаписейДляУдаления Цикл
			ЭтотОбъект.Удалить(ЗаписьДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
